const assert = require('assert')
const path = require('path')
const nadesiko3 = require('nadesiko3')
const NakoCompiler = nadesiko3.compiler
const PluginNode = nadesiko3.PluginNode
const PluginWeykDateTime = require('../index')

describe('weykdatetime_test', () => {
  const nako = new NakoCompiler()
  // nako.debugJSCode = true
  // nako.debug = true
  nako.addPluginObject('PluginNode', PluginNode)
  nako.addPluginObject('PluginWeykDateTime', PluginWeykDateTime)
  const cmp = (code, res) => {
    if (nako.debug) {
      console.log('code=' + code)
    }
    assert.equal(nako.runReset(code).log, res)
  }
  const cmd = (code) => {
    if (nako.debug) console.log('code=' + code)
    nako.runReset(code)
  }
  // --- test ---
  it('表示', () => {
    cmp('3を表示', '3')
  })
  // Datetimeのテスト ---
  it('WeykDatetTime - 日付加算', () => {
    cmp('「2017/02/10」に「0/0/0」を日付加算を表示','2017/02/10')
    cmp('「2017/02/10」に「0/1/3」を日付加算を表示','2017/03/13')
    cmp('「2017/02/10」に「-1/2/3」を日付加算を表示','2015/12/07')
    cmp('「2017/02/10」に「+1/2/3」を日付加算を表示','2018/04/13')
    cmp('「2017/02/29」に「0/0/0」を日付加算を表示','2017/03/01')
    cmp('「2017/5/5」に「-0/2/0」を日付加算を表示','2017/03/05')
  })
  it('WeykDatetTime - 時間加算', () => {
    cmp('「10:15:30」に「0:0:0」を時間加算を表示','10:15:30')
    cmp('「00:00:00」に「0:0:0」を時間加算を表示','00:00:00')
    cmp('「10:15:30」に「0:50:5」を時間加算を表示','11:05:35')
    cmp('「23:15:30」に「0:55:40」を時間加算を表示','00:11:10')
    cmp('「05:30:20」に「01:02:03」を時間加算を表示','06:32:23')
    cmp('「05:30:20」に「+01:02:03」を時間加算を表示','06:32:23')
    cmp('「05:30:20」に「-01:02:03」を時間加算を表示','04:28:17')
  })
  it('WeykDatetTime - 日数差', () => {
    cmp('「2017/05/05」から「2017/05/06」までの日数差を表示','1')
    cmp('「2017/10/10」から「2017/10/10」までの日数差を表示','0')
    cmp('「2017/03/03」から「2017/03/02」までの日数差を表示','-1')
    cmp('「2017/01/01」から「2016/01/01」までの日数差を表示','-366')
  })
  it('WeykDatetTime - 時間差', () => {
    cmp('「15:00:00」から「10:00:00」までの時間差を表示','-5')
    cmp('「23:00:00」から「23:00:00」までの時間差を表示','0')
    cmp('「12:00:00」から「36:00:00」までの時間差を表示','24')
    cmp('「05:15:30」から「08:20:30」までの時間差を表示','3')
    cmp('「08:20:30」から「05:20:31」までの時間差を表示','-2')
    cmp('「2017/10/02 00:00:00」から「2017/10/09 12:00:00」までの時間差を表示','180')
  })
  it('WeykDatetTime - 分差', () => {
    cmp('「15:20:00」から「10:00:00」までの分差を表示','-320')
    cmp('「12:15:00」から「12:15:00」までの分差を表示','0')
    cmp('「12:15:00」から「12:15:59」までの分差を表示','0')
    cmp('「12:15:59」から「12:15:00」までの分差を表示','0')
    cmp('「10:05:30」から「11:20:35」までの分差を表示','75')
    cmp('「2017/10/02 00:00:00」から「2017/10/09 12:30:00」までの分差を表示','10830')
  })
  it('WeykDatetTime - 秒差', () => {
    cmp('「15:20:55」から「10:00:00」までの秒差を表示','-19255')
    cmp('「12:15:29」から「12:15:29」までの秒差を表示','0')
    cmp('「12:15:30」から「11:29:05」までの秒差を表示','-2785')
    cmp('「2017/10/02 00:00:00」から「2017/10/09 12:30:50」までの秒差を表示','649850')
  })
  // --- ここまでweykdatetimeのテスト
})
